Revit 2027 API
Space.AreaperPerson Property
Get or set the Area per Person of the Space.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double AreaperPerson { get; set; }
Public Property AreaperPerson As Double
	Get
	Set
public:
property double AreaperPerson {
	double get ();
	void set (double value);
}
member AreaperPerson : float with get, set
Property Value
Double
Remarks
This property is used to get or set Area per Person of the Space.
See Also
Reference
Space Class
Autodesk.Revit.DB.Mechanical Namespace